{
    "name": "appmixer.slack",
    "version": "4.1.3",
    "engine": ">=6.0.0",
    "changelog": {
        "1.0.1": [
            "Initial version"
        ],
        "1.0.2": [
            "Add 'groups:read' to the listChannels component to fix 'missing_scope' error."
        ],
        "2.0.0": [
            "NewChannelMessageRT uses Appmixer listeners."
        ],
        "2.2.3": [
            "Add new components: UpdateMessage, DeleteMessage, UploadFileToChannel, UploadFileToUser, DeleteFile and GetFileMetadata."
        ],
        "2.4.1": [
            "Add new components: SendDirectMessage and ListUsers.",
            "Add new components: AddReaction, DeleteReaction, ListReactions and GetMessageReactions."
        ],
        "2.4.2": [
            "Fixed an issue with NewUser trigger throwing error when triggered."
        ],
        "3.1.0": [
            "(breaking change) SendChannelMessage, SendPrivateChannelMessage: Channel field now accepts values from other components.",
            "SendChannelMessage, SendPrivateChannelMessage: Migration to v3 - The Channel field needs to be filled again.",
            "(breaking change) New Channel Message trigger: added scope groups:read. Will require removal of account from `connected accounts` and re-authentication of Slack account.",
            "(breaking change) New User trigger now uses webhooks. The old version is now called 'NewUser - Legacy' and will be deprecated. It requiers additional configuration in your Slack account, please see the documentation.",
            "Existing triggers NewChannelMessage and NewPrivateChannelMessage are now deprecated.",
            "Updated labels to make them better to read in some components."
        ],
        "3.2.0": [
            "NewChannelMessageRT: added more output variables such as: channel, channel_type, team, event_ts, blocks, bot_profile."
        ],
        "4.1.3": [
            "(breaking change) Added payload authentication for triggers. Will require setting `signingSecret` in the connector configuration.",
            "Added options to SendChannelMessage and SendPrivateChannelMessage to send messages as a bot user.",
            "Fixed and issue when NewChannelMessageRT trigger did not register messages containing some special UTF characters."
        ]
    }
}
