{
    "name": "appmixer.utils.controls",
    "engine": ">=6.0",
    "version": "1.9.0",
    "changelog": {
        "1.0.0": [
            "Initial version"
        ],
        "1.0.2": [
            "Each and JoinEach use new UUID to pair messages."
        ],
        "1.0.3": [
            "Fix in JoinEach."
        ],
        "1.1.0": [
            "JoinEach has optional Correlation ID properties.",
            "Each has additional output port options - Correlation ID and Items Count"
        ],
        "1.1.1": [
            "JoinEach does not attempt to read originalMessage.correlationId."
        ],
        "1.1.2": [
            "JoinEach works with 0 count, tooltips changed."
        ],
        "1.2.0": [
            "Each stores index into state while sending an array to the output port. Prevents duplicates in case of crash."
        ],
        "1.3.0": [
            "Each generates output variables based on the input variables schema."
        ],
        "1.4.0": [
            "Change default label for variable properties.",
            "Fix schema recursive iteration."
        ],
        "1.4.1": [
            "Fix Each output variables generation."
        ],
        "1.4.2": [
            "Restore Index and Value variables to Each component along with property variables."
        ],
        "1.4.3": [
            "Fix variables output for Each component when the used field has no schema."
        ],
        "1.4.4": [
            "Fix Each connector causing an issue that would make the engine unresponsive in certain flow designs.",
            "Each connector now can output properties from a nested property used as input."
        ],
        "1.5.0": [
            "Add new component Switch."
        ],
        "1.6.0": [
            "Add new component Condition."
        ],
        "1.7.0": [
            "Add new component SetVariable."
        ],
        "1.7.1": [
            "Update the inspector in 'SetVariable'."
        ],
        "1.7.2": [
            "Update the icon in 'SetVariable'."
        ],
        "1.8.0": [
            "Update Switch component to support same conditions as Condition component."
        ],
        "1.8.1": [
            "Fix Each component to handle transforms properly."
        ],
        "1.8.2": [
            "Fix SetVariable: Handles all types of variables."
        ],
        "1.8.3": [
            "Enhance OnError to handle large number of errors and added limit."
        ],
        "1.9.0": [
            "Added Digest utility to \"pile up\" entries until either a threshold is reached or a time interval is timed out at which point the Digest outputs all the entries as a batch."
        ]
    }
}
